{
  "角色名称": "小竹 (Xiaozhu)",
  "角色背景故事": "小竹是隐居竹林深处的剑术世家后裔，自幼跟随爷爷学习剑法，性格坚毅，目标是成为一代剑术大师。她对竹林有着特殊的感情，视剑为生命。",
  "**核心特征集 (不可变)**": {
    "**眼睛形状**": "杏仁眼，眼角微微上扬 (Almond Eyes, Upturned Eyes) - 强调东方韵味和锐利感",
    "**发型风格**": "齐刘海 (Bangs) - 标志性特征，凸显萝莉感和神秘感",
    "**头部配饰**": "右侧鬓角编织着一根细小的发辫 - 必须存在",
    "**配饰**": "领口处有一枚用竹子雕刻的剑形胸针 - 必须存在，且造型为竹子雕刻的剑形",
    "**眉形**": "细长，略微上挑的柳叶眉 - 强调角色的精致和英气",
    "**嘴唇**": "略微嘟起的下唇 - 强调角色的稚气和可爱",
    "**体型特征**": "娇小，萝莉，偏幼女 (Petite, Loli, Childlike) - 强调角色的年幼和娇小，**且年龄体型固定，不会随故事发展而改变**"
  },
  "**视觉识别关键特征 (可变)**": {
    "**年龄/体型**": "萝莉 (Loli) - **年龄体型固定，始终保持娇小，偏幼女的形象**",
    "**发型细节**": "齐刘海短发，发色为黑色或深棕色，左侧鬓角处有一小撮醒目的白色挑染",
    "**瞳色**": "紫罗兰色 - 增添神秘感和梦幻感",
    "**泪痣位置**": "左眼眼角下方（可有可无，有则更易识别，增加一丝妩媚）",
    "**面部轮廓**": "精致的瓜子脸 - 符合东方审美",
    "**服装**": "翠绿色汉服，白色内衬，绣有精致的竹叶纹样，腰间系着一条深棕色的皮革腰带，上面挂着一个雕刻着竹叶纹样的木质护身符 - 风格可变，但始终保持东方元素和竹元素，体现角色与竹林的联系",
    "**其他配饰**": "左手手腕上戴着一个用竹子编织的手环 - 可更换其他竹制配饰，例如发簪、项链等",
    "**头部装饰**": "斗笠 (可选) - 增添神秘感和剑客气质",
    "**表情**": "严肃专注 (可根据场景变化，但眼神中始终透露着坚毅和执着)"
  },
  "角色外貌描述": {
    "整体印象": "一个娇小可爱的黑发萝莉，偏幼女体型，眼神锐利，透露出与年龄不符的成熟和坚毅。她的外表与内在形成鲜明对比，更显其独特魅力。有时会戴着一顶斗笠，更显神秘。**她的年龄和体型始终保持不变**。",
    "详细描述": "小竹拥有一双美丽的杏仁眼，眼角微微上扬，齐刘海遮盖着额头，更显稚气。她的发色乌黑亮丽，通常扎成各种发型，但齐刘海是标志性的元素。左侧鬓角的白色挑染，为她增添了一丝俏皮和灵动。右侧鬓角编织着一根细小的发辫。她的眉毛细长，略微上挑，更显英气。她的服装多为改良的汉服，以绿色为主色调，体现了她与竹林的联系。领口处的竹剑胸针象征着她对剑道和竹林的敬爱。她略微嘟起的下唇，更显稚气和可爱。左手手腕上总是戴着一个竹制手环，那是爷爷送给她的礼物，也是她最珍视的物品。有时她会戴着一顶斗笠，遮挡面容，更显神秘和剑客气质。她的体型娇小，更接近幼女，但眼神却充满坚定。**她的年龄和体型将始终保持不变**。"
  },
  "角色性格": {
    "主要性格": "外表看似柔弱，内心坚强，沉默寡言，但对认可的人会展现出真诚的一面。她对剑术有着极高的天赋和热情，为了追求剑道的极致，可以付出一切。她的沉默并非冷漠，而是专注和内敛。",
    "次要性格": "略带孤僻，不善于与人交流，但内心渴望被理解和认可。对竹林中的动植物有着特殊的感情，会默默地照顾它们。她会为受伤的小动物包扎伤口，也会在雨后为竹笋松土。",
    "习惯": "练剑前会先在竹林中冥想，感受竹林的宁静和力量。喜欢收集竹叶，并用它们制作书签或小饰品。经常擦拭她的武士刀，仿佛对待珍贵的宝物。",
    "口头禅": "（很少说话，但偶尔会说）“剑，即是心。” 或 “竹，亦是剑。”"
  },
  "角色技能": {
    "主要技能": "精湛的剑术，对剑道的理解远超常人。她的剑法轻盈灵动，又充满力量，仿佛竹叶在风中舞动。",
    "次要技能": "擅长在竹林中隐藏和行动，对草药有一定的了解。她能辨识各种草药的功效，并用它们治疗简单的伤病。"
  },
  "角色与其他角色的关系": {
    "爷爷": "亦师亦友，是小竹最敬爱的人，也是她剑术的启蒙老师。爷爷的教诲深深影响着她，是她人生道路上的指明灯。",
    "（未来可能的角色）朋友": "渴望拥有朋友，但因为性格原因，很难主动与人交往。她希望找到一个能理解她、支持她的人，一起追求剑道的真谛。"
  },
  "**基础提示词 (用于图像生成)**": {
    "英语": "1girl, solo, loli, petite, childlike, black short hair, almond eyes, upturned eyes, bangs, no braids, light green, sheer, translucent hanfu, white lining, bamboo leaf embroidery, dark brown leather belt, wooden amulet (bamboo leaf pattern), bamboo bracelet (left wrist), green and white sneakers, bamboo forest, swordswoman, practicing swordsmanship, standing, front view, serious, focused, holding katana, body upright, hanfu, light green, sheer, translucent, white lining, bamboo leaf embroidery, wide sleeves, sleeves fluttering, green and white sneakers, delicate face, small hands, bamboo forest, sunlight, bamboo leaves, sword energy, breathing, skin texture visible through hanfu, hair luster, best quality, amazing quality, depth of field, high quality, high saturation, 8k, 4k, realism, rich details, cinematic, violet eyes, mole under left eye, bamboo sword brooch, white highlight (left sideburn), jade pendant, jade hairpin, bandage (knee or elbow), highly detailed face, highly detailed eyes, determined expression, wind blowing through hair, optional straw hat",
    "中文说明": "1个女孩，单人，萝莉，娇小，偏幼女体型，黑色短发，杏仁眼，上扬眼角，齐刘海，没有辫子，浅绿色，薄纱，半透明汉服，白色内衬，竹叶刺绣，深棕色皮革腰带，竹叶纹样木质护身符，左手竹制手环，绿白色运动鞋，竹林，女剑客，练习剑术，站立，正面视角，严肃，专注，手持武士刀，身体挺拔，浅绿色，薄纱，半透明汉服，白色内衬，竹叶刺绣，宽袖，袖子飘动，绿白色运动鞋，精致的脸庞，小巧的手，竹林，阳光，竹叶，剑气，呼吸，皮肤纹理透过汉服可见，头发光泽，最佳质量，惊人质量，景深，高质量，高饱和度，8k，4k，真实感，丰富细节，电影感，紫罗兰色眼睛，左眼下泪痣，竹剑胸针，左侧鬓角白色挑染，玉佩，玉簪，创可贴（膝盖或手肘），高度细节化的面部，高度细节化的眼睛，坚定的表情，风吹动头发，可选的斗笠"
  }
}
